#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dlnkalyaniorg/demo-github-actions/runs/run-TJ2Z7kD5Bfr8tVXu

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
random_id.server_PR_7: Refreshing state... [id=06KeavfURxc]
random_id.server: Refreshing state... [id=odE_1ewwkfI]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo will be created
  + resource "aws_instance" "staging_cicd_demo" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-a1d13fd5ec3091f2"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-a1d13fd5ec3091f2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0294f8ff7fb076a63",
        ]
    }

  # aws_instance.staging_cicd_demo_PR_8 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_8" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_8"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_8"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0294f8ff7fb076a63",
        ]
    }

  # random_id.server_PR_7 will be destroyed
  # (because random_id.server_PR_7 is not in configuration)
  - resource "random_id" "server_PR_7" {
      - b64_std     = "06KeavfURxc=" -> null
      - b64_url     = "06KeavfURxc" -> null
      - byte_length = 8 -> null
      - dec         = "15249925470491526935" -> null
      - hex         = "d3a29e6af7d44717" -> null
      - id          = "06KeavfURxc" -> null
      - keepers     = {
          - "ami_id" = (sensitive value)
        } -> null
    }

  # random_id.server_PR_8 will be created
  + resource "random_id" "server_PR_8" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = (sensitive value)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + staging_dns      = (known after apply)
  + staging_dns_PR_8 = (known after apply)

```

</details>

*Pusher: @dlnkalyani, Action: `workflow_dispatch`*